app/controllers/todos_controller.rb

  def index
      @todos = Todo.find :all, :order => 'created_at DESC'
---
SELECT * FROM `todos` ORDER BY created_at DESC

  def show
    @todo = Todo.find(params[:id])
---
SELECT * FROM `todos` WHERE (`todos`.`id` = 1)

  def create
    @todo = Todo.new(params[:todo])

    respond_to do |format|
      if @todo.save
---
INSERT INTO `todos` (`updated_at`, `title`, `description`, `created_at`) VALUES('2010-06-22 15:12:14', 'write a program', 'wap a code which will show jquery implementation', '2010-06-22 15:12:14')

  def destroy
    @todo = Todo.find(params[:id])
    @todo.destroy
---
SELECT * FROM `todos` WHERE (`todos`.`id` = 9)
DELETE FROM `todos` WHERE `id` = 9